Ac6Embedded/svd-microchip/PIC32CX_BZ3/PIC32CX5109BZ36032_SL3.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>CRU</name>
         <version>031001.0</version>
         <baseAddress>0x44000A00</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x194</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>OSCCON</name>
               <description>CRU OSCILLATOR CONTROL REGISTER</description>
               <addressOffset>0x0</addressOffset>
               <resetValue>0x00200005</resetValue>
               <fields>
                  <field>
                     <name>OSWEN</name>
                     <description>Oscillator Switch Enable bit</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>OSWENSelect</name>
                        <enumeratedValue>
                           <name>SWITCH</name>
                           <description>Request oscillator switch to selection specified by NOSC[3:0] bits</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SWITCH_COMPLETE</name>
                           <description>Oscillator switch is complete</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SOSCEN</name>
                     <description>32 kHz Secondary (LP) Oscillator Enable bit</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>SOSCENSelect</name>
                        <enumeratedValue>
                           <name>ON</name>
                           <description>Enable Secondary Oscillator</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OFF</name>
                           <description>Disable Secondary Oscillator</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CF</name>
                     <description>Clock Fail Detect bit (Read / writable / Clearable by application)</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>CFSelect</name>
                        <enumeratedValue>
                           <name>FAIL_DET</name>
                           <description>FSCM has detected clock failure</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NO_FAILDET</name>
                           <description>FSCM has not detected clock failure</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SLPEN</name>
                     <description>Enable SLEEP Mode bit</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>SLPENSelect</name>
                        <enumeratedValue>
                           <name>SLEEP</name>
                           <description>When a WAIT Instruction is executed device will enter SLEEP Mode</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>IDLE</name>
                           <description>When a WAIT instruction is executed device will enter IDLE Mode</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CLKLOCK</name>
                     <description>Clock Lock Enabled bit</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>CLKLOCKSelect</name>
                        <enumeratedValue>
                           <name>LOCKED</name>
                           <description>All clock and PLL configuration registers are locked. These include OSCCON, OSCTRIM, SPLLCON, UPLLCON, PBxDIV</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>UNLOCKED</name>
                           <description>Clock and PLL selection registers are not locked, configurations may be modified</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>NOSC</name>
                     <description>New Oscillator Selection bits</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>NOSCSelect</name>
                        <enumeratedValue>
                           <name>FRCDIV</name>
                           <description>Fast RC Oscillator (FRC) divided by OSCCON.FRCDIV ( Supports FRC/16 and FRC/1)</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SPLL</name>
                           <description>System PLL (SPLL1 Module) (input clock and divider set by SPLLCON)</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>POSC</name>
                           <description>Primary Oscillator</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SOSC</name>
                           <description>Secondary Oscillator (SOSC)</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LPRC</name>
                           <description>Low Power RC Oscillator (LPRC)</description>
                           <value>0x4</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>COSC</name>
                     <description>Current Oscillator Selection bits (Read-only)</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>COSCSelect</name>
                        <enumeratedValue>
                           <name>FRCDIV</name>
                           <description>Fast RC Oscillator (FRC) divided by OSCCON.FRCDIV (Supports FRC/16 and FRC/1)</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SPLL</name>
                           <description>System PLL (SPLL1 Module) (input clock and divider set by SPLLCON)</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>POSC</name>
                           <description>Primary Oscillator- POSC</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SOSC</name>
                           <description>Secondary Oscillator (SOSC)</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LPRC</name>
                           <description>Low Power RC Oscillator (LPRC)</description>
                           <value>0x4</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>WAKE2SPD</name>
                     <description>2-Speed startup enabled in Sleep mode bit</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>WAKE2SPDSelect</name>
                        <enumeratedValue>
                           <name>FRC</name>
                           <description>When the device EXITS Sleep Mode, the sys_clk will be from FRC until the selected clock is ready</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SELECTED_CLK</name>
                           <description>When the device EXITS Sleep Mode, the sys_clk will be from the selected clock.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DRMEN</name>
                     <description>Enable Dream Mode bit</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>DRMENSelect</name>
                        <enumeratedValue>
                           <name>SLEEP</name>
                           <description>When the cpu_si_sleep input is asserted and SLPEN = 1, DMA transfer complete causes SLEEP Mode to be entered</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NO_EFFECT</name>
                           <description>DMA transfer has no effect</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FRCDIV</name>
                     <description>Fast RC Clock Divider bits</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>3</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>FRCDIVSelect</name>
                        <enumeratedValue>
                           <name>DIV_1</name>
                           <description>FRC Divide by 1</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV_2</name>
                           <description>FRC Divide by 2</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV_4</name>
                           <description>FRC Divide by 4</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV_8</name>
                           <description>FRC Divide by 8</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV_16</name>
                           <description>FRC Divide by 16</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV_32</name>
                           <description>FRC Divide by 32</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV_64</name>
                           <description>FRC Divide by 64</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV_256</name>
                           <description>FRC Divide by 256</description>
                           <value>0x7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>OSCCONCLR</name>
               <addressOffset>0x04</addressOffset>
            </register>
            <register>
               <name>OSCCONSET</name>
               <addressOffset>0x08</addressOffset>
            </register>
            <register>
               <name>OSCCONINV</name>
               <addressOffset>0x0C</addressOffset>
            </register>
            <register>
               <name>OSCTUN</name>
               <description>CRU OSCILLATOR TRIMMING REGISTER</description>
               <addressOffset>0x10</addressOffset>
               <fields>
                  <field>
                     <name>TUN</name>
                     <description>Internal Fast RC (FRC) Oscillator Tuning bits</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>TUNSelect</name>
                        <enumeratedValue>
                           <name>Max</name>
                           <description>Maximum Frequency</description>
                           <value>0x1f</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>Center</name>
                           <description>Center Frequency, oscillator is running at calibrated frequency</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>Min</name>
                           <description>Minimum Frequency</description>
                           <value>0x20</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>OSCTUNCLR</name>
               <addressOffset>0x14</addressOffset>
            </register>
            <register>
               <name>OSCTUNSET</name>
               <addressOffset>0x18</addressOffset>
            </register>
            <register>
               <name>OSCTUNINV</name>
               <addressOffset>0x1C</addressOffset>
            </register>
