Ac6Embedded/svd-microchip/PIC32CX_BZ3/PIC32CX5109BZ36032_SL3.svd
            <register>
               <name>REFO6CON</name>
               <description>REFERENCE OSCILLATOR 6 CONTROL REGISTER</description>
               <addressOffset>0x110</addressOffset>
               <fields>
                  <field>
                     <name>ROSEL</name>
                     <description>Reference Clock Source Select bits</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>ROSELSelect</name>
                        <enumeratedValue>
                           <name>REFCLKI</name>
                           <description>REFI Pin</description>
                           <value>0x8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SYSCLK</name>
                           <description>System clock (reference clock reflects any device clock switching)</description>
                           <value>0x7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PBCLK1</name>
                           <description>Peripheral clock 1 (reference clock reflects any peripheral clock switching)</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SPLL3</name>
                           <description>System PLL3 (Clock-3)</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LPRC</name>
                           <description>LPRC</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SOSC</name>
                           <description>SOSC</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>POSC</name>
                           <description>POSC</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SPLL1</name>
                           <description>System PLL1 (Clock-1)</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FRC</name>
                           <description>FRC</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ACTIVE</name>
                     <description>Reference Clock Request Status bit</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>ACTIVESelect</name>
                        <enumeratedValue>
                           <name>ACTIVE</name>
                           <description>Reference clock request is active (User should not update this REFOCON register)</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NOT_ACTIVE</name>
                           <description>Reference clock request is not active (User can update this REFOCON register)</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DIVSWEN</name>
                     <description>Clock RODIV/ROTRIM switch enabled.</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>DIVSWENSelect</name>
                        <enumeratedValue>
                           <name>SWINPROGRESS</name>
                           <description>Clock Divider Switching currently in progress.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SWCOMPLETE</name>
                           <description>Clock Divider Switch has completed.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RSLP</name>
                     <description>Reference Oscillator Run in Sleep bit</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>RSLPSelect</name>
                        <enumeratedValue>
                           <name>RSLP</name>
                           <description>Reference Oscillator output continues to run in Sleep</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NO_RSLP</name>
                           <description>Reference Oscillator output is disabled in Sleep</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>OE</name>
                     <description>Reference Clock Output Enable bit</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>OESelect</name>
                        <enumeratedValue>
                           <name>REFO6_OE</name>
                           <description>Reference clock is driven out on REFO6 pin</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NO_REFO6_OE</name>
                           <description>Reference clock is not driven out on REFO6 pin.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SIDL</name>
                     <description>Peripheral Stop in Idle Mode bit</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>SIDLSelect</name>
                        <enumeratedValue>
                           <name>SIDL</name>
                           <description>Discontinue module operation when device enters Idle mode</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NO_SIDL</name>
                           <description>Continue module operation in Idle mode</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FRZ</name>
                     <description>Freeze in Debug mode bit</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>FRZSelect</name>
                        <enumeratedValue>
                           <name>FRZ</name>
                           <description>When emulator is in Debug mode, module freezes operation</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NO_FRZ</name>
                           <description>When emulator is in Debug mode, module continues operation</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ON</name>
                     <description>Output Enable bit</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>ONSelect</name>
                        <enumeratedValue>
                           <name>ON</name>
                           <description>Reference Oscillator Module enabled</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OFF</name>
                           <description>Reference Oscillator Module disabled</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RODIV</name>
                     <description>Reference Clock Divider bits</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>15</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>RODIVSelect</name>
                        <enumeratedValue>
                           <name>65K</name>
                           <description>REFO6 clock is Base clock frequency divided by 65,534 (32,767 *2)</description>
                           <value>0x7fff</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RODIV_4</name>
                           <description>REFO6 clock is Base clock frequency divided by 4 (2*2)</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RODIV_2</name>
                           <description>REFO6 clock is Base clock frequency divided by 2 (1*2)</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NONE</name>
                           <description>REFO6 clock is same frequency as Base clock (no divider)</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>REFO6CONCLR</name>
               <addressOffset>0x114</addressOffset>
            </register>
            <register>
               <name>REFO6CONSET</name>
               <addressOffset>0x118</addressOffset>
            </register>
            <register>
               <name>REFO6CONINV</name>
               <addressOffset>0x11C</addressOffset>
            </register>
            <register>
               <name>REFO6TRIM</name>
               <description>REFERENCE OSCILLATOR 6 TRIM REGISTER</description>
               <addressOffset>0x120</addressOffset>
               <fields>
                  <field>
                     <name>ROTRIM</name>
                     <description>Trim bits - Provides fractional additive to RODIV value for 1/2 period of REFO1 clock</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>9</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>ROTRIMSelect</name>
                        <enumeratedValue>
                           <name>ZERO</name>
                           <description>0/512 (0.0) divisor added to RODIV value</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ONE</name>
                           <description>1/512 (0.001953125) divisor added to RODIV value</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TWO</name>
                           <description>2/512 (0.00390625) divisor added to RODIV value</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TRIM_256</name>
                           <description>256/512 (0.5000) divisor added to RODIV value</description>
                           <value>0x100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TRIM_512</name>
                           <description>511/512 (0.998046875) divisor added to RODIV value</description>
                           <value>0x1ff</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>REFO6TRIMCLR</name>
               <addressOffset>0x124</addressOffset>
            </register>
            <register>
               <name>REFO6TRIMSET</name>
               <addressOffset>0x128</addressOffset>
            </register>
            <register>
               <name>REFO6TRIMINV</name>
               <addressOffset>0x12C</addressOffset>
            </register>
            <register>
               <name>PB1DIV</name>
               <description>PB1 CLOCK DIVISOR CONTROL REGISTER</description>
               <addressOffset>0x130</addressOffset>
               <resetValue>0x8800</resetValue>
               <fields>
                  <field>
                     <name>PBDIV</name>
                     <description>PB1 Peripheral Clock Divisor Control value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>PBDIVSelect</name>
                        <enumeratedValue>
                           <name>DIV1</name>
                           <description>Divide by 1 PB1 Clock same frequency as sys_clk</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV2</name>
                           <description>Divide by 2 PB1 Clock is 1/2 of sys_clk</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV3</name>
                           <description>Divide by 3 PB1 Clock is 1/3 of sys_clk</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV16</name>
                           <description>Divide by 16 PB1 Clock is 1/16 of sys_clk</description>
                           <value>0xf</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV17</name>
                           <description>Divide by 17 PB1 Clock is 1/17 of sys_clk</description>
                           <value>0x10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV127</name>
                           <description>Divide by 127 PB1 Clock is 1/127 of sys_clk</description>
                           <value>0x7e</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV128</name>
                           <description>Divide by 128 PB1 Clock is 1/128 of sys_clk</description>
                           <value>0x7f</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PBDIVRDY</name>
                     <description>PB1 Peripheral Clock Divisor Ready</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>PBDIVRDYSelect</name>
                        <enumeratedValue>
                           <name>PB1RDY</name>
                           <description>Indicates the PB clock divisor logic is not switching divisors and the PB1DIV may be written.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NOT_PB1RDY</name>
                           <description>Indicates the PB clock divisor logic is currently switching values and the PB1DIV cannot be written.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PBDIVON</name>
                     <description>Output Enable bit</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>PBDIVONSelect</name>
                        <enumeratedValue>
                           <name>PB1ON</name>
                           <description>PB1 Output clock is enabled</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PB1OFF</name>
                           <description>PB1 Output clock is disabled</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
