Ac6Embedded/svd-microchip/PIC32CX_BZ3/PIC32CX5109BZ36032_SL3.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>PCHE</name>
         <version>030881.0</version>
         <description>this is the PCHE</description>
         <baseAddress>0x44012400</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x40</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>CHECON</name>
               <addressOffset>0x0</addressOffset>
               <resetValue>0x0700010F</resetValue>
               <fields>
                  <field>
                     <name>PFMWS</name>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>PREFEN</name>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>PFMSECEN</name>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ADRWS</name>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CHEPERF</name>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ICHECOH</name>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DCHECOH</name>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ACHECOH</name>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ICHEINV</name>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DCHEINV</name>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ACHEINV</name>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ICHEEN</name>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DCHEEN</name>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ACHEEN</name>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CHECONCLR</name>
               <addressOffset>0x04</addressOffset>
            </register>
            <register>
               <name>CHECONSET</name>
               <addressOffset>0x08</addressOffset>
            </register>
            <register>
               <name>CHECONINV</name>
               <addressOffset>0x0C</addressOffset>
            </register>
            <register>
               <name>CHESTAT</name>
               <addressOffset>0x10</addressOffset>
               <fields>
                  <field>
                     <name>PFMSECCNT</name>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>PFMSEC</name>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PFMDED</name>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CHESTATCLR</name>
               <addressOffset>0x14</addressOffset>
            </register>
            <register>
               <name>CHESTATSET</name>
               <addressOffset>0x18</addressOffset>
            </register>
            <register>
               <name>CHESTATINV</name>
               <addressOffset>0x1C</addressOffset>
            </register>
            <register>
               <name>CHEHIT</name>
               <addressOffset>0x20</addressOffset>
               <fields>
                  <field>
                     <name>CHEHIT</name>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CHEHITCLR</name>
               <addressOffset>0x24</addressOffset>
            </register>
            <register>
               <name>CHEHITSET</name>
               <addressOffset>0x28</addressOffset>
            </register>
            <register>
               <name>CHEHITINV</name>
               <addressOffset>0x2C</addressOffset>
            </register>
            <register>
               <name>CHEMIS</name>
               <addressOffset>0x30</addressOffset>
               <fields>
                  <field>
                     <name>CHEMIS</name>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CHEMISCLR</name>
               <addressOffset>0x34</addressOffset>
            </register>
            <register>
               <name>CHEMISSET</name>
               <addressOffset>0x38</addressOffset>
            </register>
            <register>
               <name>CHEMISINV</name>
               <addressOffset>0x3C</addressOffset>
            </register>
